<?php
?>

<main class="col-lg-8 mx-auto p-4 py-md-5">
	<h1 class="text-body-emphasis">About</h1>
	<p class="fs-5 col-md-8">Необходимо создать приложение-задачник (ToDo list).
		Фреймворки PHP использовать нельзя, библиотеки можно. Сложная архитектура не нужна.
		В приложении нужно с помощью чистого PHP реализовать модель MVC. Решите поставленные задачи минимально необходимым количеством кода.
		Верстка на bootstrap, к дизайну особых требований нет.

		Задачи состоят из:
		<ul class="list-unstyled ps-0">
			<li>
				<span>имени пользователя;</span>
			</li>
			<li>
				<span>е-mail;</span>
			</li>
			<li>
				<span>текста задачи</span>
			</li>
		</ul>

		Стартовая страница - список задач с возможностью сортировки по имени пользователя, email и статусу.
		<ul class="list-unstyled ps-0">
			<li>
				<span>Вывод задач нужно сделать страницами по 3 штуки (с пагинацией)</span>
			</li>
			<li>
				<span>Видеть список задач и создавать новые может любой посетитель без авторизации</span>
			</li>
		</ul>

		Сделайте вход для администратора (логин "admin", пароль "123").
		<ul class="list-unstyled ps-0">
			<li>
				<span>- Администратор имеет возможность редактировать текст задачи и поставить галочку о выполнении</span>
			</li>
			<li>
				<span>Выполненные задачи в общем списке выводятся с соответствующей отметкой.</span>
			</li>
		</ul>
	</p>
</main>
