<?php
?>

<main class="col-lg-8 mx-auto p-4 py-md-5">
	<h1 class="text-body-emphasis">About</h1>
	<p class="fs-5 col-md-8">Необходимо создать приложение-задачник (ToDo list).
		Фреймворки PHP использовать нельзя, библиотеки можно. Сложная архитектура не нужна.
		В приложении нужно с помощью чистого PHP реализовать модель MVC. Решите поставленные задачи минимально необходимым количеством кода.
		Верстка на bootstrap, к дизайну особых требований нет.
	</p>
	<p class="fs-5 col-md-8"><h4 class="text-body-emphasis">Задачи состоят из:</h4></p>
	<ul class="list-unstyled ps-0">
		<li>
			<span>имени пользователя</span>
		</li>
		<li>
			<span>е-mail</span>
		</li>
		<li>
			<span>текста задачи</span>
		</li>
	</ul>
	<p class="fs-5 col-md-8"><h4 class="text-body-emphasis">Стартовая страница - список задач с возможностью сортировки по имени пользователя, email и статусу</h4></p>
	<ul class="list-unstyled ps-0">
		<li>
			<span>Вывод задач нужно сделать страницами по 3 штуки (с пагинацией)</span>
		</li>
		<li>
			<span>Видеть список задач и создавать новые может любой посетитель без авторизации</span>
		</li>
	</ul>
	<p class="fs-5 col-md-8"><h4 class="text-body-emphasis">Сделайте вход для администратора (логин "admin", пароль "123").</h4></p>
	<ul class="list-unstyled ps-0">
		<li>
			<span>- Администратор имеет возможность редактировать текст задачи и поставить галочку о выполнении</span>
		</li>
		<li>
			<span>Выполненные задачи в общем списке выводятся с соответствующей отметкой.</span>
		</li>
	</ul>
</main>
